//Проходясь по массиву, мы для каждого числа считаем, его потенциально второе слагаемое, вычитая из targer наше текущее значение. Ищем обычным линейным поиском в массиве второе слагаемое начиная со следущего элемета в массиве(бесполезно искать с начала массива, так как мы уже проверяли эти элементы). Если элемент нашелся, то мы возращаем массив с парой индексов, если нет - переходим к следущеему элементу. Сложность времени O(n^2), памяти O(1)

//1 ВАРИАНТ
// const twoSum = (nums, target) => {
//   let ost;
//   for (let i = 0; i < nums.length; i++) {
//     ost = target - nums[i];
//     for (let k = i + 1; k < nums.length; k++) {
//       if (nums[k] === ost) {
//         return [i, k];
//       }
//     }
//   }
// };

//2 ВАРИАНТ
//В подсказках я увидела, что можно использовать map и это навело меня на мысль, что за один проход, можно в map записать какую-то информацию о каждом числе, а вытащить мы можем из числа только его потенциальное второе слагаемое. Так вот.
// Мы слздаем объект par куда будем записывать в качестве ключа предполагаемое второе значение, а в качестве значения элемент массива(тут можно и наоборот, роли не играет). Что нам это даст. Так как единсвенное решение гарантировано есть всегда, то в какой-то момент у нас должно появится две "зеркальных" пары. Например {7 : 2, 2 : 7, ...}, Это значит, что когда-то наше предпологаемое второе слагаемое появилось в качестве элемента массива в другой паре, итог - мы нашли пару. Поэтому на каждой итерации мы проверяем не появилось ли у нас такое второе слагаемое, если появилось, то просто выводим индексы, а если нет - просто записываем новую пару. Сложность времени O(n), памяти O(1)
const twoSum = (nums, target) => {
  let par = {};
  let ost;
  let key;
  let value;
  for (let i = 0; i < nums.length; i++) {
    ost = target - nums[i];
    key = ost;
    value = nums[i];

    if (par[value] === key) {
      console.log(ost);

      return [nums.indexOf(ost), i];
    }
    par[key] = value;
  }
};

// let nums = [1, 1, 1, 1, 1, 4, 1, 1, 1, 1, 1, 7, 1, 1, 1, 1, 1];
// let target = 11;

// let nums = [0, 4, 3, 0];
// let target = 0;

// let nums = [-1, -2, -3, -4, -5];
// let target = -8;

// let nums = [2, 7, 11, 15];
// let target = 9;

// let nums = [3, 2, 4];
// let target = 6;

let nums = [3, 3];
let target = 6;
console.log(twoSum(nums, target));
